In [4]:
import pandas as pd 
x = pd.Series (data = [10 , 2 , 13, 'yes'] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha '])
x

mohammed     10
ali           2
ahmed        13
noha        yes
dtype: object

In [5]:
x.size

4

In [6]:
x.ndim

1

In [7]:
x.shape

(4,)

In [8]:
x['mohammed']

10

In [10]:
print(x[0])
print(x[1])

10
2

In [12]:
x[-1]

'yes'

In [15]:
x.drop('ali' , inplace = True)

In [14]:
x

mohammed     10
ali           2
ahmed        13
noha        yes
dtype: object

In [26]:
item ={'x': pd.Series ( [10 , 2 , 13, 'yes'] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha ']) , 
'y' : pd.Series ([50, 60 , 70, 'yes' , ' no' , 'no' ] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha ', 'ibrahim ' , 'saad '])}
type(item)

dict

In [27]:
d = pd.DataFrame(item)
d

            x    y
ahmed      13   70
ali         2   60
ibrahim   NaN   no
mohammed   10   50
noha      yes  yes
saad      NaN   no

In [29]:
x = pd.Series (data = [10 , 2 , 13, 'yes'] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha ']) 
y = x*2 
y

mohammed        20
ali              4
ahmed           26
noha        yesyes
dtype: object

In [33]:
x = pd.Series (data = [10 , 2 , 13, 'yes'] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha ']) 
x[0] - 2 
x

mohammed     10
ali           2
ahmed        13
noha        yes
dtype: object

In [58]:
item ={'x': pd.Series ( [10 , 2 , 13, 'yes'] ) , 
'y' : pd.Series ([50, 60 , 70, 'yes' , ' no' , 'no' ] )} 
type(item)

dict

In [45]:
z= pd.DataFrame(item)
z

            x    y
ahmed      13   70
ali         2   60
ibrahim   NaN   no
mohammed   10   50
noha      yes  yes
saad      NaN   no

In [46]:
z.ndim

2

In [47]:
z.shape

(6, 2)

In [48]:
z.size

12

In [49]:
type(z)

pandas.core.frame.DataFrame

In [52]:
k ={'x': pd.Series ( [10 , 2 , 13, 'yes'] ) , 
'y' : pd.Series ([50, 60 , 70, 'yes' , ' no' , 'no' ] )}

In [55]:
mypandas = pd.DataFrame(k)
mypandas

     x    y
0   10   50
1    2   60
2   13   70
3  yes  yes
4  NaN   no
5  NaN   no

In [19]:
import pandas as pd
my_store= {'first' :pd.Series (data = [10 , 2 , 13, 'yes'] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha ']) , 
         'second' :pd.Series (data = [10 , 2 , 13, 'yes'] , index = ['mohammed' , 'ali' , 'ahmed ' , 'noha '])   
          }
my_store1 = pd.DataFrame(my_store)
my_store1

         first second
mohammed    10     10
ali          2      2
ahmed       13     13
noha       yes    yes

In [20]:
my_store2= {'third' :pd.Series (data = [110 , 310 , 510, 'no'] , index = ['anas' , 'sayed' , 'ahmed ' , 'ibrahim ']) , 
         'forth' :pd.Series (data = [10 , 2 , 13, 'no'] , index = ['mohammed' , 'galal' , 'waleed ' , 'zyad '])   
          }
my_store3 = pd.DataFrame(my_store2)
my_store3

         third forth
ahmed      510   NaN
anas       110   NaN
galal      NaN     2
ibrahim     no   NaN
mohammed   NaN    10
sayed      310   NaN
waleed     NaN    13
zyad       NaN    no

In [21]:
total = my_store3.append(my_store1)
total

C:\Users\AHMED\AppData\Local\Temp\ipykernel_18284\2473928517.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  total = my_store3.append(my_store1)

         third forth first second
ahmed      510   NaN   NaN    NaN
anas       110   NaN   NaN    NaN
galal      NaN     2   NaN    NaN
ibrahim     no   NaN   NaN    NaN
mohammed   NaN    10   NaN    NaN
sayed      310   NaN   NaN    NaN
waleed     NaN    13   NaN    NaN
zyad       NaN    no   NaN    NaN
mohammed   NaN   NaN    10     10
ali        NaN   NaN     2      2
ahmed      NaN   NaN    13     13
noha       NaN   NaN   yes    yes

In [22]:
my_store4 = my_store3.isnull()
my_store4

          third  forth
ahmed     False   True
anas      False   True
galal      True  False
ibrahim   False   True
mohammed   True  False
sayed     False   True
waleed     True  False
zyad       True  False

In [23]:
my_store5 = my_store3.isnull().sum().sum()
my_store5

8